
ANSWERS = [
    "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
    "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
    "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
    "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
    "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
    "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
    "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
    "Да, обязательно. Всем самокатов! И Москве, и Московской области."
]

MAIN_PAGE_URL = "https://qa-scooter.praktikum-services.ru/"
ORDER_PAGE_URL = "https://qa-scooter.praktikum-services.ru/order"

ORDER_DATASETS = [
    {
        "name": "Иван",
        "surname": "Петров",
        "address": "ул. Ленина, д.1",
        "metro": "Пионерская",
        "phone": "89991234567",
        "date": "26.04.2025",
        "duration": "двое суток",
        "color": "black",
        "comment": "Test set #1"
    },
    {
        "name": "Петр",
        "surname": "Иванов",
        "address": "ул. Мира, д.1",
        "metro": "Третьяковская",
        "phone": "+79667654321",
        "date": "28.04.2025",
        "duration": "пятеро суток",
        "color": "grey",
        "comment": "Test set #2"
    }
]